In [1]:
import pandas as pd

df = pd.read_csv('PYPL.dat')
df.shape

(841, 6)

In [2]:
df.head()

         date  1. open  2. high  3. low  4. close   5. volume
0  2015-07-20    41.46  42.5500   39.80     40.47  52286509.0
1  2015-07-21    41.08  41.1100   39.12     39.35  32954573.0
2  2015-07-22    39.35  39.7178   38.10     38.39  25380859.0
3  2015-07-23    38.74  38.7500   36.93     37.01  19250154.0
4  2015-07-24    37.71  38.0000   36.91     37.00  14274305.0

In [17]:
from extlibs  import ta2 

close = df['4. close']
dr = ta2.daily_return(close, fillna=True) # dr is series not Dataframe
print(dr.head())

df['gain'] = dr
print(df.head())
df[2:4]

0    0.000000
1   -2.767482
2   -2.439644
3   -3.594686
4   -0.027020
Name: d_ret, dtype: float64
         date  1. open  2. high  3. low  4. close   5. volume      gain
0  2015-07-20    41.46  42.5500   39.80     40.47  52286509.0  0.000000
1  2015-07-21    41.08  41.1100   39.12     39.35  32954573.0 -2.767482
2  2015-07-22    39.35  39.7178   38.10     38.39  25380859.0 -2.439644
3  2015-07-23    38.74  38.7500   36.93     37.01  19250154.0 -3.594686
4  2015-07-24    37.71  38.0000   36.91     37.00  14274305.0 -0.027020

         date  1. open  2. high  3. low  4. close   5. volume      gain
2  2015-07-22    39.35  39.7178   38.10     38.39  25380859.0 -2.439644
3  2015-07-23    38.74  38.7500   36.93     37.01  19250154.0 -3.594686

In [28]:
# this is func
def getupdown(row):
    ret = 'UP'
    if (row['4. close'] < row['1. open']):
        ret = 'DN'
    return ret

a = twice(6)
print(a)
print(df.tail())
df['updown'] = df.apply(lambda row: getupdown(row), axis=1)
#print(df[839]['1. open'])
df.tail()

12
           date  1. open  2. high  3. low  4. close  5. volume      gain
836  2018-11-09    88.45   88.450   85.55     86.76  9105908.0 -2.560647
837  2018-11-12    86.17   86.650   83.30     83.78  6278185.0 -3.434763
838  2018-11-13    84.12   85.229   83.16     83.78  4731289.0  0.000000
839  2018-11-14    84.98   85.140   83.07     84.05  6678468.0  0.322273
840  2018-11-15    83.79   87.090   83.60     86.74  9779650.0  3.200476

,date,1. open,2. high,3. low,4. close,5. volume,gain,updown
836,2018-11-09,88.45,88.450,85.55,86.76,9105908.0,-2.560647,DN
837,2018-11-12,86.17,86.650,83.30,83.78,6278185.0,-3.434763,DN
838,2018-11-13,84.12,85.229,83.16,83.78,4731289.0,0.000000,DN
839,2018-11-14,84.98,85.140,83.07,84.05,6678468.0,0.322273,DN
840,2018-11-15,83.79,87.090,83.60,86.74,9779650.0,3.200476,UP

In [37]:
# df iteration : https://erikrood.com/Python_References/iterate_rows_pandas.html
for idx, row in df.iterrows():
    if idx < 5:
        continue
    d2ago = df.iloc[[idx - 2]]
    d1ago = df.iloc[[idx - 1]]
    d = df.iloc[[idx]]
    print (idx, row["4. close"])
    if idx > 10:
        break
        
df.iloc[[10 - 2]]

5 36.39
6 37.6
7 37.95
8 38.45
9 38.7
10 39.39
11 38.95

         date  1. open  2. high  3. low  4. close   5. volume      gain updown
8  2015-07-30    38.04    39.01  37.715     38.45  13845091.0  1.317523     UP